Revit 2027 API
ParameterTypeId.ScheduleCategory Property
 "Category"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ScheduleCategory { get; }
Public Shared ReadOnly Property ScheduleCategory As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ScheduleCategory {
	ForgeTypeId^ get ();
}
static member ScheduleCategory : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace